Revit 2024 API
ScheduleField.FieldId Property
 The ID of the field in the containing ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ScheduleFieldId FieldId { get; }
Visual Basic
Public ReadOnly Property FieldId As ScheduleFieldId
	Get
Visual C++
public:
property ScheduleFieldId^ FieldId {
	ScheduleFieldId^ get ();
}
See Also
ScheduleField Class
Autodesk.Revit.DB Namespace